#Знайти всі чотирьохзначні числа, сума цифер яких дорівнює заданому числу
#Задане число. перевірити чи дане число є простим
#Задано ціле число N, вивести перші N чисел Фібоначчі
#Знайти сумі кубів цифер аданого натурального числа
#Заданий текст, вивести всі слова, які починаються на певну послідовніть символів

n_str = input("Input your text" + '\n')
search = input("Input what to search" + '\n')
n_list = n_str.split()
result = []
for i in n_list:
    if i.startswith(search):
        result.append(i)
print(result)
