# Вести значення (рік), вивести повідомлення "It's a leap year!" якщо рік високосний і "This is not a leap year!" якщо ні.
# Ввести три значення (рік, місяць, день) у відповідні зміннію Визначити чи введені дані відповідають коректному запису дати.
# Для довільних чисел a, b i c визначти чи має рівняння ax2+bx+c=0 хоча б один дійсний коршнь і якщо так, то видрукувати його
# Задана три довільних числа. Визначити , чи модна побудувати трикутник з такими довжинами сторін. Якщо так, то видрукувати його периметр та площу.
# Нехай k - ціле від 1 до 365. Присвоїти цілій змінній n значення (понеділок, вівторок, ..., субота чи неділя) залежно від того,
# на який день тижня припадає k-й день не високосного року, в якому перше січня - понеділок.

k = int(input("Input k" + "\n"))
if k<1 or k>365:
    print ("wrong k")
day = ["Sun", "Mon", "Tue", "Wed", "Thu", "Fri", "Sat"]
n = day [k%7]
print(n)
