# Записати в стрічку філософію Пайтона
# Знайти в заданій стрічці кількість входжень слів (better, never, is)
# Вивести весь текст у верхньому регістрі (всі великі літери)
# Замінити всі входження символу “і” на “&”

# Задано чотирицифрове натуральне число.
# Знайти добуток цифр цього числа.
# Записати число в реверсному порядку.
# Посортувати цифри, що входять в дане число

# Поміняти між собою значення двох змінних, не використовуючи третьої змінної.

a = input('Input variable a' + '\n')
b = input('Input variable b' + '\n')
print ('a =', a, 'b =', b)
a,b=b,a
print ('a =', a, 'b =', b)
